app/Controllers/Product.php

SELECT *
FROM `products`
---
    public function index()
    {
       $data['items']= $this->products->findAll();

SELECT *
FROM `products`
WHERE `products`.`product_id` = '5'
---
    public function edit($id){
        $data = $this->products->find($id);